Revit 2027 API
MultipleValuesIndicationSettings.GetMultipleValuesIndicationSettings Method
 Returns the MultipleValuesIndicationSettings element for a given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static MultipleValuesIndicationSettings GetMultipleValuesIndicationSettings(
	Document cda
)
Public Shared Function GetMultipleValuesIndicationSettings (
	cda As Document
) As MultipleValuesIndicationSettings
public:
static MultipleValuesIndicationSettings^ GetMultipleValuesIndicationSettings(
	Document^ cda
)
static member GetMultipleValuesIndicationSettings :
        cda : Document -> MultipleValuesIndicationSettings
Parameters
cda Document
 The document for which to get the MultipleValuesIndicationSettings element.
Return Value
MultipleValuesIndicationSettings
Returns the MultipleValuesIndicationSettings element in project documents or null for family documents
.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Project documents have a MultipleValuesIndicationSettings element, one per document. Family documents do not have MultipleValuesIndicationSettings elements.
See Also
Reference
MultipleValuesIndicationSettings Class
Autodesk.Revit.DB Namespace